// Решения закомментированы.
// Большое спасибо за интересные и понятные семинары!

// -------------------------------------------------------------------------------------------------

// Задача 64: Задайте значение N. Напишите программу, которая выведет
// все натуральные числа в промежутке от N до 1. Выполнить с помощью рекурсии.
// N = 5 -> "5, 4, 3, 2, 1"
// N = 8 -> "8, 7, 6, 5, 4, 3, 2, 1"

// РЕШЕНИЕ:

// string rec(int N)
// {
//     if (N == 0)
//         return "";
//     return $"{N} " + rec(N - 1);
// }

// Console.Clear();

// Console.Write("Введите значение N: ");
// int N = Convert.ToInt32(Console.ReadLine());

// Console.Write(rec(N));

// -------------------------------------------------------------------------------------------------

// Задача 66: Задайте значения M и N. Напишите программу, которая найдёт сумму натуральных элементов в промежутке от M до N.
// M = 1; N = 15 -> 120
// M = 4; N = 8. -> 30

// РЕШЕНИЕ:

// int rec(int M, int N)
// {
//     if (M > N)
//         return 0;
//     return M + rec(M + 1, N);
// }

// Console.Clear();

// Console.Write("Введите значение M: ");
// int M = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите значение N: ");
// int N = Convert.ToInt32(Console.ReadLine());

// Console.Write(rec(M, N));

// -------------------------------------------------------------------------------------------------

// Задача 68: Напишите программу вычисления функции Аккермана с помощью рекурсии. Даны два неотрицательных числа m и n.
// m = 2, n = 3 -> A(m,n) = 9
// m = 3, n = 2 -> A(m,n) = 29

// РЕШЕНИЕ:

// int rec(int m, int n)
// {
//     if (m == 0)
//         return n + 1;
//     else if (m > 0 && n == 0)
//         return (rec(m - 1, 1));
//     else
//          return rec(m - 1, rec(m, n - 1));
// }

// Console.Clear();

// Console.Write("Введите значение m: ");
// int m = Convert.ToInt32(Console.ReadLine());

// Console.Write("Введите значение n: ");
// int n = Convert.ToInt32(Console.ReadLine());

// Console.Write(rec(m, n));